Repository: coffee2code/linkify-text
Catalog: linkify-text-*.po
Languages: ru_ru

source: (especially check out the "Other Notes" tab, if present)
ru_ru: (также проверьте вкладку «Другие заметки», если она есть)

source: A value is required for: "%s"
ru_ru: Значение для: «%s» обязательно

source: All of the above terms would link to %s.
ru_ru: В данном примере все указанные слова будут ссылками на %s.

source: Automatically add links to words or phrases in your posts.
ru_ru: Автоматически добавлять ссылки на слова или фразы в записях.

source: Case sensitive text matching?
ru_ru: Соответствие текста с учётом регистра?

source: Click for more help on this plugin
ru_ru: Нажмите для получения дополнительной справки по этому плагину

source: Define only one text and associated link per line, and don't span lines.
ru_ru: В каждой строчке может быть только одно слово или фраза с указанием только одного URL-адреса или указателя на другое слово или фразу.

source: Define text and the URL they should be linked to in the field below. The format should be like this:
ru_ru: Определите привязку текста и URL-адреса в поле ниже. Формат должен выглядеть следующим образом:

source: Description: Automatically hyperlink words or phrases in your posts.
ru_ru: Описание: Автоматическое добавление гиперссылок для слов или фраз в записях.

source: Donate
ru_ru: Пожертвование

source: Donation for coffee2code plugin: %s
ru_ru: Пожертвование для плагина coffee2code: %s

source: Enable text linkification in comments?
ru_ru: Добавлять ссылки в комментариях?

source: Expected integer value for: %s
ru_ru: Ожидается целочисленное значение для: %s

source: If checked, then each term will only be linkified the first time it appears in a post.
ru_ru: Если этот флажок установлен, то каждое слово или фраза будет привязана только в первом найденном случае в каждой записи.

source: If checked, then linkification of "WordPress" would also affect "wordpress".
ru_ru: Если этот флажок установлен, то ссылка «WordPress» будет добавляться и к «wordpress».

source: If checked, then links added by this plugin will open in a new window when clicked.
ru_ru: Если этот флажок установлен, добавленные этим плагином ссылки при нажатии будут открываться в новом окне.

source: If the protocol is not specified for the URL, then 'http://' is assumed.
ru_ru: Если для URL-адреса не указан протокол, будет использован «http: //».

source: Invalid file specified for C2C_Plugin: %s
ru_ru: Недопустимый файл, указанный для C2C_Plugin: %s

source: Limit linkifications to once per term per post?
ru_ru: Ограничить привязку не более одного раза на одну запись?

source: Linkify Text Settings
ru_ru: Настройки Linkify Text

source: More Help
ru_ru: Дополнительная информация

source: More information about %1$s %2$s
ru_ru: Дополнительная информация о %1$s %2$s

source: More Plugin Help
ru_ru: Дополнительная правка по плагину

source: NOTE: A referenced term must have a link; it cannot be a reference to another term. So for the example above, "dotorg" cannot specify ":WordPress" since "WordPress" is itself a reference to another term (":WP").
ru_ru: Примечание: в качестве указателя можно использовать только слово с присвоенным URL-адресом. В данном примере «dotorg» не может указать на «:WordPress», поскольку «WordPress» является указателем на слово «:WP».

source: Open links in a new window?
ru_ru: Открывать ссылки в новом окне?

source: Other considerations:
ru_ru: Дополнительная информация:

source: Reset Settings
ru_ru: Сбросить настройки

source: Save Changes
ru_ru: Сохранить изменения

source: See the "Help" link to the top-right of the page for more help.
ru_ru: Для получения дополнительной информации см. ссылку «Помощь» в правом верхнем углу страницы.

source: Settings
ru_ru: Настройки

source: Settings reset.
ru_ru: Сброс настроек.

source: Something went wrong.
ru_ru: Что-то пошло не так.

source: Text and Links
ru_ru: Текст и ссылки

source: Text must represent a whole word or phrase, not a partial string.
ru_ru: Текст должен представлять собой целое слово или фразу, но не часть слова.

source: The plugin configuration option '%s' must be supplied.
ru_ru: Должна быть предоставлена опция конфигурации плагина '%s'.

source: Tip: Use a colon-prefixed term instead of a link to point to that term's link, e.g. <code>WP => :WordPress</code> will use the same link defined for <code>WordPress</code>
ru_ru: Совет: используйте «префикс с двоеточием» вместо URL-адреса, например, <code>WP =>: WordPress</code> будет использовать тот же URL-адрес, что и <code>WordPress</code>

source: Where <code>WordPress</code> is the text you want to get linked and <code>https://wordpress.org</code> would be the target for that link.
ru_ru: В данном примере <code>WordPress</code> это текст (слово или фраза), который вы хотите сделать ссылкой, а <code>https://wordpress.org</code> будет адресом ссылки.

source: You can link multiple terms to the same link and only have to define the link once. Simply provide the link for a given term, then for subsequent terms sharing the same link, use the original term prepended with a colon as the link, e.g.
ru_ru: Вы можете связать один URL-адрес с несколькими разными словами или фразами без необходимости каждый раз указывать URL-адрес. Для этого вместо повторного указания URL-адреса используйте указатель на слово или фразу с двоеточием, вместо URL-адреса, например:
